### Read Data From Different Sources :

In [1]:
import pandas as pd
from io import StringIO

In [4]:
data = '{"employee":"James", "age":43, "emailid":"james@gmail.com", "job_profile":[{"title1":"team lead","title2":"manager"}]}'
df = pd.read_json(StringIO(data))

In [5]:
df

  employee  age          emailid                                   job_profile
0    James   43  james@gmail.com  {'title1': 'team lead', 'title2': 'manager'}

In [7]:
df.to_json(orient='index')

'{"0":{"employee":"James","age":43,"emailid":"james@gmail.com","job_profile":{"title1":"team lead","title2":"manager"}}}'

In [8]:
df.to_json(orient="records")

'[{"employee":"James","age":43,"emailid":"james@gmail.com","job_profile":{"title1":"team lead","title2":"manager"}}]'

### Reading csv Files :

In [15]:
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [18]:
df.to_csv("wine_data.csv")

### Reading Websites :

In [25]:
url = 'https://ninjatables.com/examples-of-data-table-design-on-website/?srsltid=AfmBOor97xi_Pnpu5dYPjxEn8hm_YmjSJ_lGsIWbdQY9yxUNqWypVeUS'
df = pd.read_html(url)

In [28]:
type(df)

list

In [29]:
df[0]

,First name,Last Name,Position,Office Branch,Age,Salary
0,Ashton,Brady,Accountant,London,36,162700
1,Miles,Tenner,Integration Specialist,San Francisco,41,372000
2,Harvey,Spencer,Regional Director,London,42,470600
3,Mike,Sallanger,Personnel Lead,New York,38,220500
4,Jaden,Hyatt,Team Lead,London,35,240700
5,Donna,Hannigan,Senior Marketing Designer,San Francisco,36,275100
6,Nile,Harris,Development Lead,New York,37,345200
7,Allison,Kram,Integration Specialist,Sydney,34,270000
8,Victor,Vincent,Accountant,Sydney,40,170500
9,Bob,Randell,Accountant,New York,41,190750
10,Hannah,Griffin,Senior Marketing Designer,London,39,280200
11,Jennifer,Cowell,Regional Director,Sydney,36,190000
12,Quinn,Basser,Regional Director,San Francisco,37,360500
13,Hailey,Rogan,Integration Specialist,New York,49,290700
14,Raphael,Kwan,Personnel Lead,San Francisco,46,200100
15,Steven,Haider,Team Lead,New York,35,270000
16,Bill,Conan,Regional Director,New York,53,470000
17,Julia,Kingsley,Development Lead,San Francisco,45,350000
18,Chris,Newman,Senior Marketing Designer,Sydney,38,250000
19,John,Claude,Accountant,San Francisco,50,135000

### Reading Pickle File :

In [31]:
df[0].to_pickle("web_data")

In [32]:
pd.read_pickle("web_data")

,First name,Last Name,Position,Office Branch,Age,Salary
0,Ashton,Brady,Accountant,London,36,162700
1,Miles,Tenner,Integration Specialist,San Francisco,41,372000
2,Harvey,Spencer,Regional Director,London,42,470600
3,Mike,Sallanger,Personnel Lead,New York,38,220500
4,Jaden,Hyatt,Team Lead,London,35,240700
5,Donna,Hannigan,Senior Marketing Designer,San Francisco,36,275100
6,Nile,Harris,Development Lead,New York,37,345200
7,Allison,Kram,Integration Specialist,Sydney,34,270000
8,Victor,Vincent,Accountant,Sydney,40,170500
9,Bob,Randell,Accountant,New York,41,190750
10,Hannah,Griffin,Senior Marketing Designer,London,39,280200
11,Jennifer,Cowell,Regional Director,Sydney,36,190000
12,Quinn,Basser,Regional Director,San Francisco,37,360500
13,Hailey,Rogan,Integration Specialist,New York,49,290700
14,Raphael,Kwan,Personnel Lead,San Francisco,46,200100
15,Steven,Haider,Team Lead,New York,35,270000
16,Bill,Conan,Regional Director,New York,53,470000
17,Julia,Kingsley,Development Lead,San Francisco,45,350000
18,Chris,Newman,Senior Marketing Designer,Sydney,38,250000
19,John,Claude,Accountant,San Francisco,50,135000